# Getting Financial Data - Google Finance

### Introduction:

This time you will get data from a website.


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline
sns.set(style='ticks', context='talk')
sns.set(rc={"figure.figsize": (8, 8)})

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

from IPython.core.display import HTML
css = open('../../style-table.css').read() + open('../../style-notebook.css').read()
HTML('<style>%s</style>' % css)

### Step 2. Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is)

In [2]:
import datetime

start = datetime.datetime.strptime('01/01/2015', '%d/%M/%Y').date()
end = datetime.datetime.now().date()

start, end

(datetime.date(2015, 1, 1), datetime.date(2018, 2, 21))

### Step 3. Select the Apple, Tesla, Twitter, IBM, LinkedIn stocks symbols and assign them to a variable called stocks

In [3]:
stocks = ['AAPL', 'TSLA', 'IBM', 'LNKD']

### Step 4. Read the data from google, assign to df and print it

In [4]:
try:
    import pandas_datareader
except:
    !pip install pandas_datareader

import pandas_datareader.data as web

In [5]:
df = web.DataReader(stocks, 'morningstar', start, end)
df.head()

                    Close    High      Low    Open    Volume
Symbol Date
AAPL   2015-01-01  110.38  110.38  110.380  110.38         0
       2015-01-02  109.33  111.44  107.350  111.39  53204626
       2015-01-05  106.25  108.65  105.410  108.29  64285490
       2015-01-06  106.26  107.43  104.630  106.54  65797116
       2015-01-07  107.75  108.20  106.695  107.20  40105934

### Step 5.  What is the type of structure of df ?

In [6]:
df.dtypes

Close     float64
High      float64
Low       float64
Open      float64
Volume      int64
dtype: object

### Step 6. Print all the Items axis values
#### To learn more about the Panel structure go to [documentation](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#panel)

In [7]:
# Panel is deprecated

### Step 7. Good, now we know  the data avaiable. Create a dataFrame called vol, with the Volume values.

In [8]:
vol = df.Volume.to_frame().unstack('Symbol')
vol.columns = vol.columns.droplevel()
vol.head()

Symbol          AAPL      IBM     LNKD     TSLA
Date
2015-01-01         0        0        0        0
2015-01-02  53204626  5525466  1203743  4764443
2015-01-05  64285490  4880389  1400562  5368477
2015-01-06  65797116  6146712  2006546  6261936
2015-01-07  40105934  4701839   985016  2968390

### Step 8. Aggregate the data of Volume to weekly
#### Hint: Be careful to not sum data from the same week of 2015 and other years.

In [9]:
vol.resample('W').sum().head()

Symbol           AAPL       IBM     LNKD      TSLA
Date
2015-01-04   53204626   5525466  1203743   4764443
2015-01-11  283252614  24458400  7203125  22709607
2015-01-18  304226646  23263205  7084168  30799137
2015-01-25  198737041  31244856  5549477  16215501
2015-02-01  465842684  32928061  5810679  15720217

### Step 9. Find all the volume traded in the year of 2015

In [10]:
vol.groupby(vol.index.year).sum()

Symbol         AAPL         IBM       LNKD        TSLA
Date
2015    13068421446  1105584799  441128979  1088281586
2016     9686186610  1019174936  569878287  1162408261
2017     6811471285  1070968835          0  1590067848
2018     1370425553   224791111          0   202247946

In [11]:
vol[vol.index.year == 2015].head()
vol[vol.index.year == 2015].tail()

Symbol          AAPL      IBM     LNKD     TSLA
Date
2015-01-01         0        0        0        0
2015-01-02  53204626  5525466  1203743  4764443
2015-01-05  64285490  4880389  1400562  5368477
2015-01-06  65797116  6146712  2006546  6261936
2015-01-07  40105934  4701839   985016  2968390

Symbol          AAPL      IBM    LNKD     TSLA
Date
2015-12-25         0        0       0        0
2015-12-28  26704210  3143412  470291  1901304
2015-12-29  30931243  3943691  731152  2406290
2015-12-30  25213777  2989367  670140  3697921
2015-12-31  40912316  3462037  695684  2715038

### BONUS: Create your own question and answer it.